Былков_ДА_70180166/src/Documents/АкадемическаяНеуспеваемость/АкадемическаяНеуспеваемость.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АкадемическаяНеуспеваемость</name>
  <registerRecords>AccumulationRegister.КонтрольАкадемическойНеуспеваемости</registerRecords>
  <attributes>
    <name>ИндексСтудента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ХарактеристикаСтудента</name>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормаКонтроля</name>
      <type>
        <types>EnumRef.ФормаКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаВозникновенияЗадолженности</name>
      <type>
        <types>EnumRef.ПричинаВозникновенияЗадолженности</types>
      </type>
    </attributes>
    <attributes>
      <name>Семестр</name>
      <type>
        <types>EnumRef.Семестры</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Былков_ДА_70180166/src/Documents/АкадемическаяНеуспеваемость/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.АкадемическаяНеуспеваемость.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АкадемическаяНеуспеваемость.Дата,
	|	АкадемическаяНеуспеваемость.ИндексСтудента,
	|	АкадемическаяНеуспеваемость.Номер,
	|	АкадемическаяНеуспеваемость.ХарактеристикаСтудента.(
	|		НомерСтроки,
	|		Дисциплина,
	|		ФормаКонтроля,
	|		ПричинаВозникновенияЗадолженности,
	|		Семестр
	|	)
	|ИЗ
	|	Документ.АкадемическаяНеуспеваемость КАК АкадемическаяНеуспеваемость
	|ГДЕ
	|	АкадемическаяНеуспеваемость.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьХарактеристикаСтудентаШапка = Макет.ПолучитьОбласть("ХарактеристикаСтудентаШапка");
	ОбластьХарактеристикаСтудента = Макет.ПолучитьОбласть("ХарактеристикаСтудента");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьХарактеристикаСтудентаШапка);
		ВыборкаХарактеристикаСтудента = Выборка.ХарактеристикаСтудента.Выбрать();
		Пока ВыборкаХарактеристикаСтудента.Следующий() Цикл
			ОбластьХарактеристикаСтудента.Параметры.Заполнить(ВыборкаХарактеристикаСтудента);
			ТабДок.Вывести(ОбластьХарактеристикаСтудента, ВыборкаХарактеристикаСтудента.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
